# SQL

In [ ]:
pip install ipython-sql #installs jupyter extension for sql

In [4]:
%load_ext sql

C:\Program Files (x86)\Anaconda3\lib\site-packages\IPython\config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
C:\Program Files (x86)\Anaconda3\lib\site-packages\IPython\utils\traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [8]:
%config SqlMagic.autopandas=True #automatically return panda data frame

In [9]:
import pandas as pd
import sqlite3

In [10]:
%%sql sqlite://
    CREATE TABLE presidents (first_name, last_name, year_of_birth);
    INSERT INTO presidents VALUES('George', 'Washington', 1732);
    INSERT INTO presidents VALUES('John', 'Adams', 1735);
    INSERT INTO presidents VALUES('Thomas', 'Jefferson', 1743);

Done.
1 rows affected.
1 rows affected.
1 rows affected.

Empty DataFrame
Columns: []
Index: []

In [11]:
later_presidents = %sql SELECT * FROM presidents WHERE year_of_birth > 1732;
later_presidents

Done.

  first_name  last_name  year_of_birth
0       John      Adams           1735
1     Thomas  Jefferson           1743

In [12]:
type(later_presidents)

pandas.core.frame.DataFrame

In [13]:
#write out into a file
con=sqlite3.connect("presidents.sqlite")
later_presidents.to_sql("presidents", con, if_exists='replace')

In [14]:
#use pandas directly instead of sql magic
con = sqlite3.connect("presidents.sqlite")
cur = con.cursor()

new_dataframe = pd.read_sql("SELECT * \
                            FROM presidents",
                           con=con)

con.close()

In [15]:
new_dataframe

   index first_name  last_name  year_of_birth
0      0       John      Adams           1735
1      1     Thomas  Jefferson           1743